In [1]:
!pip install bs4
!pip install requests

Requirement already satisfied: bs4 in /usr/local/lib/python3.7/dist-packages (0.0.1)
Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.7/dist-packages (from bs4) (4.6.3)
Requirement already satisfied: requests in /usr/local/lib/python3.7/dist-packages (2.23.0)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /usr/local/lib/python3.7/dist-packages (from requests) (1.24.3)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.7/dist-packages (from requests) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from requests) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.7/dist-packages (from requests) (2020.12.5)

##**1. Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.**

In [2]:
from bs4 import BeautifulSoup
import requests
import re

In [3]:
page=requests.get("https://en.wikipedia.org/wiki/Main_Page")
page

In [4]:
soup=BeautifulSoup(page.content)

In [5]:
all_title=soup.find_all('span',class_="mw-headline")
all_title
print("ALL THE HEADINGS PRESENT IN THE LINK ARE")
print("----------------------------------------")
for i in all_title:
    print(i.text)

ALL THE HEADINGS PRESENT IN THE LINK ARE
----------------------------------------
From today's featured article
Did you know ...
In the news
On this day
Today's featured picture
Other areas of Wikipedia
Wikipedia's sister projects
Wikipedia languages

## **2.Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release) and make data frame.**

In [6]:
url = 'http://www.imdb.com/chart/top'
response = requests.get(url)
response

In [7]:
soup = BeautifulSoup(response.text, 'lxml')

In [8]:
movies = soup.select('td.titleColumn')
ratings = [b.attrs.get('data-value') for b in soup.select('td.posterColumn span[name=ir]')]

In [9]:
imdb = []

for index in range(0, 100):
    
    movie_string = movies[index].get_text()
    movie = (' '.join(movie_string.split()).replace('.', ''))
    movie_title = movie[len(str(index))+1:-7]
    year = re.search('\((.*?)\)', movie_string).group(1)
    
    data = {"movie_title": movie_title,
            "year": year,
            "rating": ratings[index],
            }
    imdb.append(data)

for item in imdb:
  print(item['movie_title'], item['rating'], '('+item['year']+') -')

The Shawshank Redemption 9.219816992003642 (1994) -
The Godfather 9.147535603905258 (1972) -
The Godfather: Part II 8.980006946439744 (1974) -
The Dark Knight 8.970019301150264 (2008) -
12 Angry Men 8.9351153778534 (1957) -
Schindler's List 8.909490875829869 (1993) -
The Lord of the Rings: The Return of the King 8.885359500358494 (2003) -
Pulp Fiction 8.838362446715301 (1994) -
The Good, the Bad and the Ugly 8.787769498917232 (1966) -
 The Lord of the Rings: The Fellowship of the Ring 8.77667339958099 (2001) -
Fight Club 8.754080470630267 (1999) -
Forrest Gump 8.743204682459783 (1994) -
Inception 8.714359866203301 (2010) -
The Lord of the Rings: The Two Towers 8.699501470654315 (2002) -
Star Wars: Episode V - The Empire Strikes Back 8.696051851309603 (1980) -
The Matrix 8.644118364976457 (1999) -
Goodfellas 8.642775424375412 (1990) -
One Flew Over the Cuckoo's Nest 8.636220825499267 (1975) -
Seven Samurai 8.610866173408601 (1954) -
Se7en 8.587343004314604 (1995) -
The Silence of the Lambs 8.576687917885458 (1991) -
City of God 8.576430234167715 (2002) -
It's a Wonderful Life 8.574565128020135 (1946) -
Life Is Beautiful 8.57450993088607 (1997) -
Star Wars: Episode IV - A New Hope 8.554191168652055 (1977) -
Saving Private Ryan 8.548021572807588 (1998) -
Spirited Away 8.537463512477624 (2001) -
The Green Mile 8.533522613937606 (1999) -
Interstellar 8.533400841485737 (2014) -
Parasite 8.527224719758921 (2019) -
Léon: The Professional 8.501870515562725 (1994) -
Hara-Kiri 8.495853809310876 (1962) -
The Usual Suspects 8.490212244199267 (1995) -
The Pianist 8.487165813590279 (2002) -
Back to the Future 8.483917510004225 (1985) -
Terminator 2: Judgment Day 8.483092872976263 (1991) -
Modern Times 8.481988614873519 (1936) -
Psycho 8.481860247327907 (1960) -
The Lion King 8.48024284236322 (1994) -
American History X 8.47509654052649 (1998) -
City Lights 8.473159732285037 (1931) -
Gladiator 8.4670428084222 (2000) -
Whiplash 8.465791758110175 (2014) -
The Departed 8.46573511883185 (2006) -
Grave of the Fireflies 8.465015321889028 (1988) -
The Intouchables 8.461067372803086 (2011) -
The Prestige 8.451863538520232 (2006) -
Casablanca 8.44979029309981 (1942) -
Once Upon a Time in the West 8.44885229625217 (1968) -
Rear Window 8.438200103257108 (1954) -
Cinema Paradiso 8.434294155566832 (1988) -
Alien 8.42340772748532 (1979) -
Apocalypse Now 8.41828481733988 (1979) -
Memento 8.411760885548986 (2000) -
Indiana Jones and the Raiders of the Lost Ark 8.409786742051322 (1981) -
The Great Dictator 8.406636669142657 (1940) -
The Lives of Others 8.391745231020014 (2006) -
Django Unchained 8.38820812619709 (2012) -
Paths of Glory 8.382940014673334 (1957) -
Sunset Blvd 8.376203149640146 (1950) -
WALL·E 8.370898554506025 (2008) -
The Shining 8.365747190398986 (1980) -
Witness for the Prosecution 8.359109245991156 (1957) -
Avengers: Infinity War 8.35897156942126 (2018) -
Joker 8.35849306387645 (2019) -
Dr Strangelove or: How I Learned to Stop Worrying and Love the Bomb 8.354423233143606 (1964) -
Spider-Man: Into the Spider-Verse 8.349662807732978 (2018) -
Oldboy 8.343999447414895 (2003) -
Princess Mononoke 8.34396814442459 (1997) -
Hamilton 8.339122707883014 (2020) -
Once Upon a Time in America 8.32506454950763 (1984) -
Your Name 8.324202908218009 (2016) -
The Dark Knight Rises 8.322727469107612 (2012) -
Aliens 8.321839966831938 (1986) -
Pather Panchali 8.319728099468675 (1955) -
Coco 8.318533073194741 (2017) -
Das Boot 8.307692080353043 (1981) -
Capharnaüm 8.305299375533844 (2018) -
High and Low 8.30468278137309 (1963) -
Avengers: Endgame 8.304283169717026 (2019) -
American Beauty 8.301179914916672 (1999) -
Toy Story 8.295431372335235 (1995) -
Braveheart 8.294587911646238 (1995) -
Amadeus 8.293583885692833 (1984) -
3 Idiots 8.29247265224167 (2009) -
Inglourious Basterds 8.285256425685578 (2009) -
Good Will Hunting 8.277782462698273 (1997) -
Star Wars: Episode VI - Return of the Jedi 8.276414709561731 (1983) -
2001: A Space Odyssey 8.274245712049304 (1968) -
Reservoir Dogs 8.273997638356807 (1992) -
M 8.27360551985882 (1931) -
Like Stars on Earth 8.271304637068768 (2007) -
Citizen Kane 8.270190140895442 (1941) -
Vertigo 8.269577542216176 (1958) -
Requiem for a Dream 8.262491969893867 (2000) -
The Hunt 8.261154543859622 (2012) -
Singin' in the Rain 8.258120541534494 (1952) -
North by Northwest 8.258018617993075 (1959) -
Come and See 8.257376807556582 (1985) -
 Eternal Sunshine of the Spotless Mind 8.256831850619404 (2004) -

In [10]:
import pandas as pd
df = pd.DataFrame(imdb)
df

                               movie_title  year             rating
0                 The Shawshank Redemption  1994  9.219816992003642
1                            The Godfather  1972  9.147535603905258
2                   The Godfather: Part II  1974  8.980006946439744
3                          The Dark Knight  2008  8.970019301150264
4                             12 Angry Men  1957    8.9351153778534
..                                     ...   ...                ...
95                                The Hunt  2012  8.261154543859622
96                     Singin' in the Rain  1952  8.258120541534494
97                      North by Northwest  1959  8.258018617993075
98                            Come and See  1985  8.257376807556582
99   Eternal Sunshine of the Spotless Mind  2004  8.256831850619404

[100 rows x 3 columns]

### cleaning the data

In [11]:
df['rating']=df['rating'].astype(float)
df['year']=df['year'].astype(int)

In [12]:
df['rating']=df['rating'].round(decimals=2)

In [13]:
df.head()

                movie_title  year  rating
0  The Shawshank Redemption  1994    9.22
1             The Godfather  1972    9.15
2    The Godfather: Part II  1974    8.98
3           The Dark Knight  2008    8.97
4              12 Angry Men  1957    8.94

In [14]:
df.shape

(100, 3)

## **3.Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release) and make data frame.**

In [15]:
url = 'https://www.imdb.com/india/top-rated-indian-movies/'
response = requests.get(url)
response

In [16]:
soup = BeautifulSoup(response.text, 'lxml')

In [17]:
movies = soup.select('td.titleColumn')
ratings = [b.attrs.get('data-value') for b in soup.select('td.posterColumn span[name=ir]')]

In [18]:
imdb_ind = []

for index in range(0, 100):
    
    movie_string = movies[index].get_text()
    movie = (' '.join(movie_string.split()).replace('.', ''))
    movie_title = movie[len(str(index))+1:-7]
    year = re.search('\((.*?)\)', movie_string).group(1)
    
    data = {"movie_title": movie_title,
            "year": year,
            "rating": ratings[index],
            }
    imdb_ind.append(data)

for item in imdb_ind:
  print(item['movie_title'], item['rating'], '('+item['year']+') -')

Pather Panchali 8.507212503149667 (1955) -
Nayakan 8.482145464576451 (1987) -
Pariyerum Perumal 8.47444268427505 (2018) -
Anbe Sivam 8.472093425382296 (2003) -
Hanky Panky 8.463177992664527 (1979) -
C/o Kancharapalem 8.460830889835094 (2018) -
The World of Apu 8.460653152441846 (1959) -
Kireedam 8.437973236761842 (1989) -
Manichitrathazhu 8.437588364306876 (1993) -
 Natsamrat 8.436028058495173 (2016) -
Drishyam 2 8.429175250368925 (2021) -
96 8.41836827115615 (2018) -
Black Friday 8.409406018949731 (2004) -
Thevar Magan 8.406241114020212 (1992) -
Kumbalangi Nights 8.390591670096448 (2019) -
3 Idiots 8.348538549103377 (2009) -
Visaaranai 8.345507541931367 (2015) -
Like Stars on Earth 8.331134781908213 (2007) -
Jersey 8.318025658279415 (2019) -
Raatchasan 8.31642148458277 (2018) -
Thalapathi 8.304115525488506 (1991) -
Soorarai Pottru 8.301493995202376 (2020) -
Dangal 8.301078468539488 (2016) -
Asuran 8.28854828135551 (2019) -
Kaithi 8.285377580190788 (2019) -
Devasuram 8.284118218764721 (1993) -
Aparajito 8.283659739245723 (1956) -
Jaane Bhi Do Yaaro 8.270423792265337 (1983) -
Pyaasa 8.257640462226956 (1957) -
Peranbu 8.2548302997796 (2018) -
Guide 8.25405602561175 (1965) -
Vada Chennai 8.251947828076366 (2018) -
Thani Oruvan 8.247717992452314 (2015) -
A Peck on the Cheek 8.246022386371518 (2002) -
Chupke Chupke 8.238060888799934 (1975) -
Iruvar 8.227896070788717 (1997) -
Spadikam 8.22742516682942 (1995) -
Agent Sai Srinivasa Athreya 8.221900860765412 (2019) -
Drishyam 8.219198463515777 (2013) -
Super Deluxe 8.218543691851021 (2019) -
Vikram Vedha 8.218426102386598 (2017) -
Aruvi 8.216735802621255 (2016) -
Tumbbad 8.210444091523627 (2018) -
Mahanati 8.205187484053598 (2018) -
Khosla Ka Ghosla! 8.204110931694284 (2006) -
Anand 8.18835760771238 (1971) -
Pudhu Pettai 8.184739990599315 (2006) -
Premam 8.181443278620362 (2015) -
Kaakkaa Muttai 8.17142874105142 (2014) -
Anniyan 8.170910705767254 (2005) -
Andhadhun 8.167922586562181 (2018) -
Bangalore Days 8.167049956674425 (2014) -
Dhuruvangal Pathinaaru 8.166282035563952 (2016) -
Mudhalvan 8.165338942379424 (1999) -
Papanasam 8.163895045829703 (2015) -
Satya 8.16356076312237 (1998) -
Shahid 8.157651153903803 (2012) -
Soodhu Kavvum 8.155430280036315 (2013) -
Jigarthanda 8.143671153257369 (2014) -
Pithamagan 8.142712678862463 (2003) -
Gangs of Wasseypur 8.130573667384867 (2012) -
Paan Singh Tomar 8.129561283966503 (2012) -
Sairat 8.129183665363053 (2016) -
Bhaag Milkha Bhaag 8.12562188208981 (2013) -
Talvar 8.12263238184611 (2015) -
Hera Pheri 8.119605298590228 (2000) -
Swades 8.115209707621144 (2004) -
Sholay 8.114373613895767 (1975) -
Black 8.113513411722218 (2005) -
Ustad Hotel 8.11153603148244 (2012) -
Chak De! India 8.111533613882626 (2007) -
Nil Battey Sannata 8.110185762143143 (2015) -
Jo Jeeta Wohi Sikandar 8.107819968146446 (1992) -
Drishyam 8.10514396222202 (2015) -
Charulata 8.104334353060086 (1964) -
Mughal-E-Azam 8.104271257975004 (1960) -
Maheshinte Prathikaaram 8.103675289382418 (2016) -
Zindagi Na Milegi Dobara 8.10281163556739 (2011) -
Article 15 8.099739601385362 (2019) -
Udaan 8.098615589116056 (2010) -
A Wednesday 8.096071485229125 (2008) -
Theeran Adhigaram Ondru 8.095011396742304 (2017) -
Queen 8.094429584297224 (2013) -
Masaan 8.091575465227404 (2015) -
Sarfarosh 8.088164693928734 (1999) -
Munna Bhai MBBS 8.087804947084715 (2003) -
Alai Payuthey 8.086393634789408 (2000) -
Dil Chahta Hai 8.083995666854596 (2001) -
Roja 8.083763067768642 (1992) -
OMG: Oh My God! 8.08229480339164 (2012) -
Baasha 8.082099880628244 (1995) -
Rang De Basanti 8.079228121403707 (2006) -
Lagaan: Once Upon a Time in India 8.07018576213168 (2001) -
Kahaani 8.06970959069557 (2012) -
Andaz Apna Apna 8.068489034070694 (1994) -
Chhichhore 8.067074909345683 (2019) -
Uri: The Surgical Strike 8.064073853125244 (2018) -
Virumandi 8.063393338632332 (2004) -
PK 8.062551612340028 (2014) -
 Lucia 8.054880919593204 (2013) -

In [19]:
import pandas as pd
df2 = pd.DataFrame(imdb_ind)
df2

                 movie_title  year             rating
0            Pather Panchali  1955  8.507212503149667
1                    Nayakan  1987  8.482145464576451
2          Pariyerum Perumal  2018   8.47444268427505
3                 Anbe Sivam  2003  8.472093425382296
4                Hanky Panky  1979  8.463177992664527
..                       ...   ...                ...
95                Chhichhore  2019  8.067074909345683
96  Uri: The Surgical Strike  2018  8.064073853125244
97                 Virumandi  2004  8.063393338632332
98                        PK  2014  8.062551612340028
99                     Lucia  2013  8.054880919593204

[100 rows x 3 columns]

In [20]:
df2['rating']=df2['rating'].astype(float)
df2['year']=df2['year'].astype(int)

In [21]:
df2['rating']=df2['rating'].round(decimals=2)

In [22]:
df2.head()

         movie_title  year  rating
0    Pather Panchali  1955    8.51
1            Nayakan  1987    8.48
2  Pariyerum Perumal  2018    8.47
3         Anbe Sivam  2003    8.47
4        Hanky Panky  1979    8.46

In [23]:
df2.shape

(100, 3)

## **4.Write a python program to scrap book name, author name, genre and book review of any 5 books from www.bookpage.com**

In [24]:
url = 'https://bookpage.com/reviews'
response = requests.get(url)
soup = BeautifulSoup(response.text, 'lxml')
print(response)

<Response [200]>

In [25]:
soup = BeautifulSoup(response.text, 'lxml')

In [26]:
book_names=[]
author_names=[]
genres=[]
reviews=[]

In [27]:
book_page=requests.get(url)
book_soup=BeautifulSoup(book_page.content,'html.parser')
bookpage=book_soup.find_all('h4',class_='italic')
for i in bookpage:
  book_names.append(i.find('a').text)
  book_author=book_soup.find_all('p',class_='sans bold')
for i in book_author:
  author_names.append(i.text.replace('\n',''))
  book_genre=book_soup.find_all('p',class_='genre-links hidden-phone')
for i in book_genre:
  genres.append(i.find('a').text)
  book_review=book_soup.find_all('p',class_='excerpt')
for i in book_review:
  reviews.append(i.text.replace('\n',''))

In [28]:
book_details=pd.DataFrame({})
book_details['Book Name']=book_names
book_details['Author Name']=author_names
book_details['Book Genres']=genres
book_details['Book Reviews']=reviews

In [29]:
book_details.head()

                                      Book Name  ...                                       Book Reviews
0                        ★ The Other Black Girl  ...  Brilliantly positioned at the intersection of ...
1                    ★ Walking on Cowrie Shells  ...  With the ease of a master, Nana Nkweti shifts ...
2                                 Malibu Rising  ...  Malibu Rising is packed with plenty of scintil...
3                              Both Can Be True  ...  “We’re all in the same boat, paddling through ...
4   ★ The One Hundred Years of Lenni and Margot  ...  Even in the face of death’s inevitability, fri...

[5 rows x 4 columns]

## 5. **Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’.** 

You have to scrape: 

i) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [30]:
url = 'https://www.icc-cricket.com/rankings/mens/team-rankings/odi'
response = requests.get(url)

In [31]:
team_page=requests.get(url)
soup=BeautifulSoup(team_page.content,'html.parser')
team=soup.find_all('span',class_='u-hide-phablet')

In [32]:
teams=[]
matches=[]
points=[]
ratings=[]

In [33]:
for i in team:
  teams.append(i.text)
  teams=teams[:10]
  match_row1=soup.find_all('td',class_='rankings-block__banner--matches')
for i in match_row1:
  matches.append(i.text)
  match_row2=soup.find_all('td',class_='table-body__cell u-center-text')  
for i in range(0,len(match_row2),2):
  matches.append(match_row2[i].text)
  matches=matches[:10]
  odi_point1=soup.find_all('td',class_='rankings-block__banner--points')
for i in odi_point1:
  points.append(i.text)
  odi_point2=soup.find_all('td',class_='table-body__cell u-center-text')
for i in range(1,len(match_row2),2):
  points.append(odi_point2[i].text)
  points=points[:10]
  odi_rating=soup.find_all('td',class_='rankings-block__banner--rating u-text-right')
for i in odi_point1:
  points.append(i.text)
  odi_point2=soup.find_all('td',class_='table-body__cell u-center-text')
for i in range(1,len(match_row2),2):
  points.append(odi_point2[i].text)
  points=points[:10]
  odi_rating=soup.find_all('td',class_='rankings-block__banner--rating u-text-right')
for i in odi_rating:
  ratings.append(i.text.replace('\n','').replace(' ',''))
  odi_rating=soup.find_all('td',class_='table-body__cell u-text-right rating')
for i in odi_rating:
  ratings.append(i.text.replace('\n','').replace(' ',''))
  ratings=ratings[:10]

In [34]:
import pandas as pd
teams_details=pd.DataFrame({})
teams_details['teams']=teams
teams_details['matches']=matches
teams_details['points']=points
teams_details['ratings']=ratings

In [35]:
teams_details.head()

          teams matches points ratings
0   New Zealand      17  2,054     121
1     Australia      25  2,945     118
2         India      29  3,344     115
3       England      27  3,100     115
4  South Africa      20  2,137     107


ii) Top 10 ODI Batsmen in men along with the records of their team and rating.

In [36]:
url = 'https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting'
response = requests.get(url)

In [37]:
page=requests.get(url)
soup=BeautifulSoup(page.content,'html.parser')

In [38]:
players=[]
teams=[]
ratings=[]

In [39]:
# First Row of the table
odi_player=soup.find_all('div',class_='rankings-block__banner--name-large')
for i in odi_player:
  players.append(i.text)
    
    # Other rows in the table
odi_player=soup.find_all('td',class_='table-body__cell rankings-table__name name')
for i in odi_player:
  players.append(i.find('a').text)
players=players[:10]
    
    # First Row of the table
odi_team=soup.find_all('div',class_='rankings-block__banner--nationality')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
        
    #  Other rows in the table
odi_team=soup.find_all('span',class_='table-body__logo-text')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
teams=teams[:10]
    
    # First Row of the table
odi_rating=soup.find_all('div',class_='rankings-block__banner--rating')
for i in odi_rating:
  ratings.append(i.text)
        
    #  Other rows in the table
odi_rating=soup.find_all('td',class_='table-body__cell rating')
for i in odi_rating:
  ratings.append(i.text)
ratings=ratings[:10]

In [40]:
batsmen_odi=pd.DataFrame({})
batsmen_odi['players']=players
batsmen_odi['teams']=teams
batsmen_odi['ratings']=ratings

In [41]:
batsmen_odi.head()

        players teams ratings
0    Babar Azam   PAK     865
1   Virat Kohli   IND     857
2  Rohit Sharma   IND     825
3   Ross Taylor    NZ     801
4   Aaron Finch   AUS     791

iii) Top 10 ODI bowlers along with the records of their team and rating.

In [42]:
url = 'https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling'
response = requests.get(url)

In [43]:
page=requests.get(url)
soup=BeautifulSoup(page.content,'html.parser')

In [44]:
bowler_page=requests.get(url)
bowler_soup=BeautifulSoup(bowler_page.content,'html.parser')

In [45]:
players=[]
teams=[]
ratings=[]

In [46]:
odi_player=soup.find_all('div',class_='rankings-block__banner--name-large')
for i in odi_player:
  players.append(i.text)

odi_player=soup.find_all('td',class_='table-body__cell rankings-table__name name')
for i in odi_player:
  players.append(i.find('a').text)
players=players[:10]

odi_team=soup.find_all('div',class_='rankings-block__banner--nationality')
for i in odi_team:
  teams.append(i.text.replace('\n',''))

odi_team=soup.find_all('span',class_='table-body__logo-text')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
teams=teams[:10]

odi_rating=soup.find_all('div',class_='rankings-block__banner--rating')
for i in odi_rating:
  ratings.append(i.text)
        
odi_rating=soup.find_all('td',class_='table-body__cell rating')
for i in odi_rating:
  ratings.append(i.text)
ratings=ratings[:10]

In [47]:
bowler_odi=pd.DataFrame({})
bowler_odi['players']=players
bowler_odi['teams']=teams
bowler_odi['ratings']=ratings

In [48]:
bowler_odi.head()

            players teams ratings
0       Trent Boult    NZ     737
1      Mehedi Hasan   BAN     713
2  Mujeeb Ur Rahman   AFG     708
3        Matt Henry    NZ     691
4    Jasprit Bumrah   IND     690

## **6. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:** 

i) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [49]:
url = 'https://www.icc-cricket.com/rankings/womens/team-rankings/odi'
response = requests.get(url)
response

In [50]:
page=requests.get(url)
soup=BeautifulSoup(page.content,'html.parser')

In [51]:
teams=[]
matches=[]
points=[]
ratings=[]

In [52]:
odi_team=soup.find_all('span',class_='u-hide-phablet')
for i in odi_team:
  teams.append(i.text)
teams=teams[:10]
    
match_row1=soup.find_all('td',class_='rankings-block__banner--matches')
for i in match_row1:
  matches.append(i.text)

match_row2=soup.find_all('td',class_='table-body__cell u-center-text')
for i in range(0,len(match_row2),2):
  matches.append(match_row2[i].text)
matches=matches[:10]
    
odi_point1=soup.find_all('td',class_='rankings-block__banner--points')
for i in odi_point1:
  points.append(i.text)
        
odi_point2=soup.find_all('td',class_='table-body__cell u-center-text')
for i in range(1,len(match_row2),2):
  points.append(odi_point2[i].text)
points=points[:10]
    
odi_rating=soup.find_all('td',class_='rankings-block__banner--rating u-text-right')
for i in odi_rating:
  ratings.append(i.text.replace('\n','').replace(' ',''))
    
odi_rating=soup.find_all('td',class_='table-body__cell u-text-right rating')
for i in odi_rating:
  ratings.append(i.text.replace('\n','').replace(' ',''))
ratings=ratings[:10]

In [53]:
teams_odi=pd.DataFrame({})
teams_odi['teams']=teams
teams_odi['matches']=matches
teams_odi['points']=points
teams_odi['ratings']=ratings

In [54]:
teams_odi

          teams matches points ratings
0     Australia      18  2,955     164
1  South Africa      24  2,828     118
2       England      17  1,993     117
3         India      20  2,226     111
4   New Zealand      21  1,947      93
5   West Indies      12  1,025      85
6      Pakistan      15  1,101      73
7    Bangladesh       5    306      61
8     Sri Lanka      11    519      47
9       Ireland       2     25      13

ii) Top 10 women’s ODI players along with the records of their team and rating.

In [55]:
url = 'https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting'
response = requests.get(url)
response

In [60]:
page=requests.get(url)
soup=BeautifulSoup(page.content,'html.parser')

In [61]:
players=[]
teams=[]
ratings=[]

In [62]:
odi_player=soup.find_all('div',class_='rankings-block__banner--name-large')
for i in odi_player:
  players.append(i.text)
    
odi_player=soup.find_all('td',class_='table-body__cell rankings-table__name name')
for i in odi_player:
  players.append(i.find('a').text)
players=players[:10]
    
odi_team=soup.find_all('div',class_='rankings-block__banner--nationality')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
        
odi_team=soup.find_all('span',class_='table-body__logo-text')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
teams=teams[:10]
    
odi_rating=soup.find_all('div',class_='rankings-block__banner--rating')
for i in odi_rating:
  ratings.append(i.text)
        
odi_rating=soup.find_all('td',class_='table-body__cell rating')
for i in odi_rating:
  ratings.append(i.text)
ratings=ratings[:10]

In [63]:
batsmen_odi=pd.DataFrame({})
batsmen_odi['players']=players
batsmen_odi['teams']=teams
batsmen_odi['ratings']=ratings

In [64]:
batsmen_odi

             players teams ratings
0     Tammy Beaumont   ENG     765
1        Lizelle Lee    SA     758
2       Alyssa Healy   AUS     756
3    Stafanie Taylor    WI     746
4        Meg Lanning   AUS     723
5  Amy Satterthwaite    NZ     715
6    Smriti Mandhana   IND     710
7        Mithali Raj   IND     709
8     Natalie Sciver   ENG     685
9    Laura Wolvaardt    SA     683

iii) Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [65]:
url = 'https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder'
response = requests.get(url)
response

In [66]:
page=requests.get(url)
soup=BeautifulSoup(page.content,'html.parser')

In [67]:
players=[]
teams=[]
ratings=[]

In [68]:
odi_player=soup.find_all('div',class_='rankings-block__banner--name-large')
for i in odi_player:
  players.append(i.text)
    
odi_player=soup.find_all('td',class_='table-body__cell rankings-table__name name')
for i in odi_player:
  players.append(i.find('a').text)
players=players[:10]
    
odi_team=soup.find_all('div',class_='rankings-block__banner--nationality')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
        
odi_team=soup.find_all('span',class_='table-body__logo-text')
for i in odi_team:
  teams.append(i.text.replace('\n',''))
teams=teams[:10]
    
odi_rating=soup.find_all('div',class_='rankings-block__banner--rating')
for i in odi_rating:
  ratings.append(i.text)
        
odi_rating=soup.find_all('td',class_='table-body__cell rating')
for i in odi_rating:
  ratings.append(i.text)
ratings=ratings[:10]

In [69]:
bowler_odi=pd.DataFrame({})
bowler_odi['players']=players
bowler_odi['teams']=teams
bowler_odi['ratings']=ratings

In [70]:
bowler_odi

            players teams ratings
0    Marizanne Kapp    SA     418
1      Ellyse Perry   AUS     418
2   Stafanie Taylor    WI     410
3    Natalie Sciver   ENG     349
4     Deepti Sharma   IND     343
5     Jess Jonassen   AUS     307
6  Ashleigh Gardner   AUS     252
7  Dane van Niekerk    SA     243
8     Sophie Devine    NZ     242
9       Amelia Kerr    NZ     236

## **7.Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.**

In [71]:
url = 'https://www.amazon.in/best-mobile-under-20000/s?k=best+mobile+under+20000'
response = requests.get(url)
response

In [72]:
page=requests.get(url)
soup=BeautifulSoup(page.content,'html.parser')

In [73]:
Product=[] 
Price=[]
Rating=[]
Image=[]

In [74]:
item= soup.find_all('span',class_='a-size-medium a-color-base a-text-normal')
for i in item:
    Product.append(i.text) 


price= soup.find_all('span',class_='a-price-whole')
for i in price:
    Price.append(i.text)
rating= soup.find_all('span',class_='a-icon-alt')


for i in rating:
    Rating.append(i.text)
image= soup.find_all('div', class_='a-section aok-relative s-image-fixed-height')


for i in image:
    Image.append(i.find('img'))

In [75]:
Mobile_under20k=pd.DataFrame({})
Mobile_under20k['Product']=Product[0:5]
Mobile_under20k['Price']=Price[0:5]
Mobile_under20k['Image']=Image[0:5]
Mobile_under20k['Rating']=Rating[0:5]

In [76]:
Mobile_under20k

                                             Product  ...              Rating
0  Redmi 9A (Nature Green, 2GB RAM, 32GB Storage)...  ...  4.2 out of 5 stars
1  Samsung Galaxy M12 (Blue,4GB RAM, 64GB Storage...  ...  4.0 out of 5 stars
2  Redmi 9 (Sky Blue, 4GB RAM, 64GB Storage)| 500...  ...  4.2 out of 5 stars
3  Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB...  ...  4.1 out of 5 stars
4  Oppo A31 (Mystery Black, 6GB RAM, 128GB Storag...  ...  4.3 out of 5 stars

[5 rows x 4 columns]

### **8.Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.**

In [77]:
def getWeather(url,element,classname):
    page=requests.get(url)
    soup=BeautifulSoup(page.content)
    Detail=soup.find_all(element,classname)
    Detail_List=[]
    for i in Detail:
        Detail_List.append(i.text)
    return Detail_List

In [78]:
weather1=getWeather('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YJzf19UzbIU','p','period-name')
weather1

['Today',
 'Tonight',
 'Friday',
 'FridayNight',
 'Saturday',
 'SaturdayNight',
 'Sunday',
 'SundayNight',
 'Monday']

In [79]:
weather2=getWeather('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YJzf19UzbIU','div','col-sm-2 forecast-label')
weather2

['Today',
 'Tonight',
 'Friday',
 'Friday Night',
 'Saturday',
 'Saturday Night',
 'Sunday',
 'Sunday Night',
 'Monday',
 'Monday Night',
 'Tuesday',
 'Tuesday Night',
 'Wednesday']

In [80]:
short_desc=getWeather('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YJzf19UzbIU','p','short-desc')
short_desc

['Sunny thenSunny andBreezy',
 'IncreasingClouds',
 'Mostly Sunnythen Sunnyand Breezy',
 'Mostly Clearand Breezythen MostlyClear',
 'Sunny',
 'Mostly Clear',
 'Sunny',
 'Mostly Clear',
 'Sunny']

In [81]:
temp_high=getWeather('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YJzf19UzbIU','p','temp temp-high')
temp_high

['High: 68 °F', 'High: 68 °F', 'High: 68 °F', 'High: 67 °F', 'High: 64 °F']

In [82]:
temp_low=getWeather('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YJzf19UzbIU','p','temp temp-low')
temp_low

['Low: 54 °F', 'Low: 52 °F', 'Low: 52 °F', 'Low: 52 °F']

In [83]:
temp=[]
for i in range(0,len(temp_low)):
    temp.append(temp_high[i])
    temp.append(temp_low[i])

temp.append(temp_high[4])
temp

['High: 68 °F',
 'Low: 54 °F',
 'High: 68 °F',
 'Low: 52 °F',
 'High: 68 °F',
 'Low: 52 °F',
 'High: 67 °F',
 'Low: 52 °F',
 'High: 64 °F']

In [84]:
Desc=getWeather('https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YJzf19UzbIU','div',"col-sm-10 forecast-text")
Desc
print(len(Desc))

13

In [85]:
import pandas as pd
weather_detail=pd.DataFrame({})
weather_detail['Period']=weather1
weather_detail['Short Description']=short_desc
weather_detail['Temperature']=temp
weather_detail['Description']=Desc[0:9]
weather_detail

          Period  ...                                        Description
0          Today  ...  Sunny, with a high near 68. Breezy, with a wes...
1        Tonight  ...  Increasing clouds, with a low around 54. West ...
2         Friday  ...  Mostly cloudy, then gradually becoming sunny, ...
3    FridayNight  ...  Mostly clear, with a low around 52. Breezy, wi...
4       Saturday  ...  Sunny, with a high near 68. West wind 5 to 10 ...
5  SaturdayNight  ...                Mostly clear, with a low around 52.
6         Sunday  ...                        Sunny, with a high near 67.
7    SundayNight  ...                Mostly clear, with a low around 52.
8         Monday  ...                        Sunny, with a high near 64.

[9 rows x 4 columns]

## **9.  Write a python program to scrape fresher job listings from ‘https://internshala.com/’. It should include job title, company name, CTC, and apply date.**

In [86]:
page=requests.get("https://internshala.com/fresher-jobs")
page

In [87]:
soup=BeautifulSoup(page.content)

In [88]:
job_titles=[]
companies_names=[]
ctc_amount=[]
apply_date=[]

In [89]:
titles=soup.find_all('div',class_="heading_4_5 profile")
for i in titles:
  job_titles.append(i.text.replace('\n',''))


companies=soup.find_all('a',class_='link_display_like_text')
for i in companies:
  companies_names.append(i.text.strip())


ctc=soup.find_all('div',class_='item_body')
for i in ctc:
  ctc_amount.append(i.get_text(strip=True))
del (ctc_amount[::3])
ctc_amount=ctc_amount[::2]


date=soup.find_all('div',class_='item_body')
for i in date:
  apply_date.append(i.get_text(strip=True))
del (apply_date[::3])
del (apply_date[::2])

In [90]:
len(apply_date)

40

In [91]:
import pandas as pd
jobs=pd.DataFrame({})
jobs['title']=job_titles
jobs['company']=companies_names
jobs['ctc']=ctc_amount
jobs['apply date']=apply_date

In [92]:
jobs.head()

                               title   company            ctc apply date
0       Customer Service Specialist   Wono Inc  5.2 - 6.4 LPA  3 Jul' 21
1                  Graphic Designer   Wono Inc    5 - 6.5 LPA  3 Jul' 21
2      Digital Marketing Specialist   Wono Inc    5 - 6.5 LPA  3 Jul' 21
3  Junior Corporate Sales Executive     Wyntem    3 - 3.5 LPA  3 Jul' 21
4                 Backend Developer    HomeJam    7 - 8.5 LPA  3 Jul' 21